Added diagrams
